app/views/users/show.html.erb

UPDATE "users" SET "remember_digest" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["remember_digest", "$2a$04$6QSI.ryHYHs88TM15O7oyu23DvroieXK..qNu/bqW84JhaMnrKtZi"], ["updated_at", "2019-09-11 23:19:53.886209"], ["id", 762146111]]
---
<%= @user.name %>, <%= @user.email %> <%= @user.created_at %> <%= @user.updated_at %>

SELECT "microposts".* FROM "microposts" WHERE "microposts"."user_id" = ? ORDER BY "microposts"."created_at" DESC  [["user_id", 1]]
SELECT 1 AS one FROM "microposts" WHERE "microposts"."user_id" = ? LIMIT ?  [["user_id", 2], ["LIMIT", 1]]
SELECT COUNT(*) FROM "microposts" WHERE "microposts"."user_id" = ?  [["user_id", 2]]
---
    <%= render 'follow_form' if logged_in? %>
    <% if @user.microposts.any? %>
      <h3>Microposts (<%= @user.microposts.count %>)</h3>