app/controllers/microposts_controller.rb

SELECT "microposts".* FROM "microposts" WHERE "microposts"."user_id" = ? AND "microposts"."id" = ? ORDER BY "microposts"."created_at" DESC LIMIT ?  [["user_id", 101], ["id", 301], ["LIMIT", 1]]
---
    def correct_user
        @micropost = current_user.microposts.find_by(id: params[:id])