app/controllers/users_controller.rb

UPDATE "users" SET "remember_digest" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["remember_digest", "$2a$04$AiU579B7zq0w6VELO9AWOOk6PR2gEVMk9MkETvq8WCWUAWEhDq8VO"], ["updated_at", "2019-09-11 00:46:13.942695"], ["id", 762146111]]
---
    def update
      if @user.update_attributes(user_params)

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 101], ["LIMIT", 1]]
---
    def destroy
      User.find(params[:id]).destroy